QUESTION_1 = ('Полночь. Все уже давно легли спать и только вы, захватив с собой мантию невидимку, '
              '\nспустились в гостиную, где встретились со своими друзьями Роном и Гермионой. '
              '\nВы уже собрались отправиться за философским камнем, но тут вам преградил путь ваш '
              '\nсокурсник Невилл Долгопупс. Он против того, чтобы вы нарушали школьные правила '
              '\nи собирается помешать вам это сделать. Как вы поступите?'
              '\n1)	Попытаетесь убедить его вам не мешать'
              '\n2)	Примените заклинание Петрификус Тоталус (заклинание, вызывающее временную полную парализацию тела)'
              '\n3)	Подерётесь\n')

QUESTION_2 = ('И вот вы уже направляетесь к коридору на третьем этаже. Но чтобы попасть к люку вам надо '
              '\nпройти мимо трехголовой собаки Хагрида по кличке «Пушок». Как вы это сделаете?'
              '\n1)	Сыграете на подаренной Хагридом флейте'
              '\n2)	Станцуете'
              '\n3)	Ничего не будете делать, ведь Снейп уже заколдовал арфу играть музыку'
              '\n4)	Стрельните в Пушка Авадой Кедаврой\n')

QUESTION_3 = ('И вот вы прыгнули в люк. К счастью, приземление оказалось мягким. Но о ужас!... '
              '\nВы попали в дьявольские силки, и они скоро вас задушат. Что будете делать?'
              '\n1)	С помощью волшебства зажжете огонь'
              '\n2)	Кричать и поднимать панику'
              '\n3)	Попытаетесь срезать растение\n')

QUESTION_4 = ('И вот вы попали в следующую комнату. Но вот не задача. Следующая дверь заперта, '
              '\nа все ключи заколдованы и летают на большой скорости под потолком. '
              '\nНо к счастью, у вас есть метлы. Кто из вас отправиться ловить ключ?'
              '\n1)	Рон Уизли'
              '\n2)	Гермиона Грейнджер'
              '\n3)	Гарри Поттер\n')

QUESTION_5 = ('Гарри Поттер как самый молодой ловец Хогвартса за прошедшие сто лет с легкостью '
                '\nсправится с этой задачей, но только какой же из ключей ему надо поймать?'
                '\n1) Самый красивый золотой ключ'
                '\n2) Самый маленький черный ключ'
                '\n3) Большой старинный ключ, серебряный, как и дверная ручка\n')

QUESTION_6 = ('Вы смогли пройти в следующую комнату. Перед вами распростерлась гигантская шахматная '
              '\nдоска. Чтобы пройти дальше вам надо выиграть партию. Кого вы назначите главным игроком?'
              '\n1)	Гермиону Грейнджер'
              '\n2)	Рона Уизли'
              '\n3)	Гарри Поттера'
              '\n4)	Будете играть все вместе\n')

QUESTION_7 = ('Рон прекрасный шахматист и без труда справляется со своей ролью. Но вот вы, занявшие '
              '\nместо слона совсем не помните как он должен ходить. Как по правилам должен ходить слон?'
              '\n1) По прямой'
              '\n2) Буквой «Г»'
              '\n3) По диагонали\n')

QUESTION_8 = ('Партия проходит успешно. Но чтобы выиграть надо пожертвовать фигурой коня, '
              '\nместо которой занимает Рон. Как вы поступите?'
              '\n1) Надо придумать другой вариант, нельзя жертвовать товарищами'
              '\n2) Дадите Рону самому решить как поступить\n')

QUESTION_9 = ('Рон остался в комнате с шахматами. Вы же с Гермионой продолжили путь дальше '
              '\nсамостоятельно. И вот перед вами новая комната и новое испытание. На столе стоит '
              '\nшесть сосудов. В двух из них яд, в двух – вода, в одном – зелье, пропускающее '
              '\nвперед и в одном – назад. Причем яд находится не в крайних и не в двух средних '
              '\nсосудах. Зелье, отправляющее назад не с правого края, а вода посередине. '
              '\nГде находятся зелья пропускающие вперед и назад?'
              '\n1)	Первое слева'
              '\n2)	Второе слева'
              '\n3)	Третье слева'
              '\n4)	Четвертое слева'
              '\n5)	Пятое слева'
              '\n6)	Шестое слева\n')

QUESTION_10 = ('У вас только одно зелье, пропускающее вперед. Как вы поступите?'
               '\n1) Вперед пойдет Гермиона, а Гарри вернется назад'
               '\n2) Вперед пойдет Гарри, Гермиона вернется назад'
               '\n3) Оба выпьете из сосуда с зельем пропускающим вперед\n')

QUESTION_11 = ('Вы добрались до последней комнаты, но вместо Снейпа вы увидели '
               '\nпрофессора Квирелла. Что будете делать?'
               '\n1) Порадуетесь, что он здесь, ведь он точно пришел помочь'
               '\n2) Будете в шоке, неужели Квирелл собирался все это время украсть философский камень?\n')

QUESTION_12 = ('Вы увидели в зеркале Еиналеж, что камень находится у вас в кармане. Ваши действия:'
               '\n1) Достанете его из кармана, надо же проверить действительно ли это тот самый камень'
               '\n2) Скажете об увиденном вслух'
               '\n3) Ничего не будете делать\n')

QUESTION_13 = ('Вот неожиданность!... Под тюрбаном профессора Квирелла все это время '
               '\nскрывался Волан-де-Морт. Но у вас появился шанс повергнуть врага, '
               '\nведь ваши прикосновения разрушают его магию. Ваши действия:'
               '\n1) Ничего не делать'
               '\n2) Напасть на Квирелла\n')

NEGATIVE = 'Вы провалили задание. Вам не удалось победить Волан-де-Морта и защитить филосовский камень.'

END = ('Вы победили Волан-де-Морта и защитили философский камень! Поздравляем!')
